-- MySQL dump 10.13  Distrib 9.3.0, for macos14.7 (arm64)
--
-- Host: localhost    Database: productstore
-- ------------------------------------------------------
-- Server version	9.3.0

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `Products`
--

DROP TABLE IF EXISTS `Products`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Products` (
  `Id` int NOT NULL AUTO_INCREMENT,
  `Name` varchar(255) COLLATE utf8mb4_general_ci NOT NULL,
  `Description` text COLLATE utf8mb4_general_ci NOT NULL,
  `Price` decimal(10,2) NOT NULL,
  `Stock` int NOT NULL,
  `ImageUrl` varchar(10000) COLLATE utf8mb4_general_ci DEFAULT NULL,
  PRIMARY KEY (`Id`)
) ENGINE=InnoDB AUTO_INCREMENT=91 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Products`
--

LOCK TABLES `Products` WRITE;
/*!40000 ALTER TABLE `Products` DISABLE KEYS */;
INSERT INTO `Products` VALUES (1,'קיצור תולדות האנושות ','לפני מאה אלף שנים חיו בכדור הארץ לפחות שישה מינים שונים של אדם. לאף אחד מהם לא היתה חשיבות מיוחדת. תפקידם בטבע לא היה גדול מזה של גורילות, גחליליות או סוסוני ים.\n\nלפני כשבעים אלף שנה התחולל שינוי מסתורי כלשהו בתודעתו של אחד ממיני האדם הללו - הומו סאפיינס - ודחף אותו להשתלט על העולם כולו.\n\nההיסטוריה של הומו סאפיינס מאז ועד היום היא לעתים מזעזעת, לעתים משעשעת, ותמיד מרתקת. מה בדיוק קרה להומו סאפיינס לפני שבעים אלף שנה שדחף אותו להשתלט על העולם? איך ולמה נעלמו כל יתר מיני האדם?\n\nמתי הפך הכלב לידידו הטוב של האדם? מתי המציאו את הכסף ואת האלים הגדולים, ומדוע? על שום מה סברו כמעט כל החברות האנושיות בהיסטוריה שנשים נחותות מגברים? האם אפשר לקיים חברה אנושית ללא אפליה וללא דעות קדומות?\n\nהאם אפשר לשלוט ביעילות ולאורך זמן בעמים כבושים? כיצד כבשו המדע, הקפיטליזם ואירופה את העולם? האם יש להיסטוריה כיוון? האם יש צדק בהיסטוריה? האם בני אדם נהיו מאושרים יותר לאורך ההיסטוריה? ומה הסיכוי שיהיו בני אדם בכדור הארץ בעוד מאה שנה?\n\nקיצור תולדות האנושות מנסה להציע תשובות על שאלות אלו ואחרות, ולתת סקירת בזק על תהליכי המפתח ונקודות המפנה העיקריות של ההיסטוריה מאז הופעת האדם על בימת העולם ועד ימינו. הספר מזמין אותנו אל מאחורי הקלעים של ההיסטוריה, ומדגיש בפנינו עד כמה משונה היא העלילה, כמה בלתי צפויים הם השחקנים, וכמה מעט אנו יודעים על העבר שלנו.\n\nיובל נח הררי מרצה בחוג להיסטוריה באוניברסיטה העברית בירושלים. מתמחה בהיסטוריה צבאית ובהיסטוריה של ימי הביניים, פרסם ספרים ומאמרים על המלחמה בימי הביניים ובעת החדשה. מחקריו האחרונים עוסקים בשאלת הקשר בין היסטוריה לביולוגיה, ובשאלות של אושר, סבל ומוסר בתולדות האנושות.\n\nזה כשמונה שנים הוא שותף בתוכנית \"לימודי היסטוריה עולמית\" של האוניברסיטה העברית, אשר שואפת לחקור וללמד את ההיסטוריה של המין האנושי, במבט־על החוצה גבולות גיאוגרפיים, תקופתיים ותרבותיים. הררי מלמד את הקורס \"מבוא להיסטוריה עולמית\", הסוקר את תולדות האנושות מאז הופעת האדם על פני כדור הארץ ועד ימינו.',10.00,24,'https://images-evrit.yit.co.il/Images/Products/newcovers/kitzur_toldot_haenoshut_master.jpg'),(2,'ההיסטוריה של המחר','זהו ספר שבוחן את זהותה של האנושות ואת חלומותיה, ומציע מבט מרענן ומפתיע על העולם של המאה ה–21.\n\nאחרי שהשתלט על כדור הארץ הציב האדם לעצמו שלושה יעדים חדשים: לחיות לנצח, להיות מאושר ולשדרג את עצמו לדרגת אל.  לשָם מכוונת האנושות את מאמציה יום יום, שעה שעה, במעבדות, במכוני מחקר, בשווקים ובפסי הייצור. זה התהליך החשוב ביותר שהאנושות עוברת בעת הזו. הוא מעצב לא רק את עתיד העולם, אלא גם את היומיום של כל אחד ואחת מאיתנו.\nספרו הראשון של יובל נח הררי, קיצור תולדות האנושות, תיאר כיצד הפך קוף–אדם אפריקאי לשליט כדור הארץ. הספר עמד בראש רשימת רבי–המכר בישראל במשך יותר משלוש שנים, תורגם ליותר משלושים שפות, והפך לרב–מכר במדינות רבות נוספות, מבריטניה וספרד ועד לסלובניה וטייוואן. ה\'סאנדיי טיימס\' הבריטי הגדיר אותו: \"ספר שמטאטא את קורי העכביש מהמוח\".\nבספרו השני, ההיסטוריה של המחר, מתמקד הררי בסדר היום של האנושות במאה הנוכחית.\nהספר חושף את האמונות והסיפורים שעיצבו את חיינו עד כה, ומתאר את לידתה של דת חדשה ונועזת שעומדת לכבוש את העולם בסערה. אחרי שתקראו את הספר הזה, סביר שתסתכלו אחרת על הסמארטפון שלכם, על הסופרמרקט במורד הרחוב, על הדשא של השכן ועל הבבואה הנשקפת מהמראה בחדר האמבטיה...\nקיצור תולדות האנושות תפס ולא הרפה,\nההיסטוריה של המחר יטלטל ולא יניח.\n\nפרופ\' יובל נח הררי מרצה בחוג להיסטוריה באוניברסיטה העברית. הוא מתמחה בהיסטוריה עולמית, בהיסטוריה צבאית ובהיסטוריה של אירופה בימי הביניים.\n\nמחקריו הנוכחיים של פרופ\' הררי עוסקים במערכת היחסים בין היסטוריה, ביולוגיה ותורת המידע, ועבודתו מבוססת על ההנחה שכדי להתמודד עם האתגרים שהאנושות עומדת בפניהם במאה ה–21, יש צורך בידע מתחומים מגוונים ובקשר הדוק בין הממסד המדעי לבין הציבור.\n\n- במה שונה האדם מכל יתר בעלי החיים ומה איפשר לו לכבוש את העולם?\n- איך השתכנע האדם שהוא לא רק שולט בעולם אלא גם נותן לו משמעות?\n- כיצד הפך פולחן האדם (ההומניזם) לדת החשובה בתבל?\n- איך מאיימת הקִדמה הטכנולוגית על ההומניזם?\n- האם האדם מסוגל להמשיך לנהל את העולם ולתת לו משמעות?\n- מה עשוי למלא את מקומם של האדם ושל ההומניזם?',50.00,55,'https://images-evrit.yit.co.il/Images/Products/newcovers/hahistorya_shel_hamachar_master.jpg'),(3,'21 מחשבות על המאה ה-21','״קיצור תולדות האנושות״ היה ספר על העבר.\n״ההיסטוריה של המחר״ היה ספר על העתיד.\nעכשיו בא תורו של ההווה. \n21 מחשבות על המאה ה־21 הוא ספר על ההווה.\nעל המהפכות, הוויכוחים, הספקות, הסכנות וההזדמנויות של הרגע הזה.\n זה ספר שבו יובל נח הררי מכוון את איזמל המנתחים החד שלו לסוגיות מורכבות המוכרות לכל קורא — הגירה, טכנולוגיה, עבודה, טרור, סביבה, פוליטיקה - כדי להכניס בהן\nקצת סדר והיגיון. \n \nפרופ\' יובל נח הררי מרצה בחוג להיסטוריה באוניברסיטה העברית בירושלים. הוא מתמחה בהיסטוריה של ימי הביניים, בהיסטוריה צבאית ובהיסטוריה עולמית.\nספריו קיצור תולדות האנושות וההיסטוריה של המחר תורגמו ליותר מחמישים שפות ונמכרו, נכון לסוף שנת 2017, ביותר מ־12 מיליון עותקים.',10.00,80,'https://images-evrit.yit.co.il/Images/Products/covers_2018/21_machshavot_al_hamea_ha_master.jpg'),(4,'נקסוס','סיפורן של רשתות המידע, ואיך הן יצרו ופירקו את העולם — מאת יובל נח הררי, מחבר רבי־המכר הבינלאומיים קיצור תולדות האנושות וההיסטוריה של המחר.\n\nבמשך מאה אלף השנים האחרונות צברו בני האדם כוח עצום. אך למרות כל התגליות, ההמצאות והכיבושים שלנו, אנחנו נמצאים כעת במשבר קיומי. כדור הארץ על סף קריסה אקולוגית. המתחים הפוליטיים מתעצמים. אנחנו מוצפים במידע כוזב, ובקושי מסוגלים לנהל שיחה רציונלית. ואנחנו מפתחים בכל הכוח את הבינה המלאכותית — טכנולוגיית מידע רבת־עוצמה שעלולה לצאת משליטתנו ולהשמיד אותנו. אם בני האדם כל כך חכמים, למה אנחנו עושים כאלה דברים טיפשיים?\n\nנקסוּס הוא ספר שבוחן את זרם המידע שסחף אותנו לכאן. החוקר והסופר יובל נח הררי מוביל אותנו מעידן האבן ליצירת התנ\"ך, המצאת הדפוס, הופעתה של תקשורת ההמונים ועליית הפופוליזם של העידן הנוכחי — ומזמין את הקוראים לחקור את הקשר המורכב שבין מידע ואמת, בירוקרטיה ומיתולוגיה, תבונה וכוח. הררי בוחן כיצד רשתות מידע שונות — כגון האימפריה הרומית, הכנסייה הקתולית, ברית המועצות ופייסבוק – השתמשו במידע אמיתי ובדיוני כדי להשיג את מטרותיהן, לטוב ולרע. תוך סקירת אירועי השנים האחרונות ומתוך מבט לעתיד, הוא מציג את הדילמות שניצבות לפנינו בשעה זו, כשבינה לא־אנושית מאיימת על הישרדותנו.\n\nרגע לפני שהאנושות מאבדת את עצמה לדעת – כדאי לעצור, לנשום עמוק, ולגלות מחדש את האנושיות המשותפת לכולנו.',15.00,100,'https://images-evrit.yit.co.il/Images/Products/NewBO/Products/33414/neksus_new_Master.jpg'),(5,'1984','\"האם האח הגדול קיים?\"\n\"ודאי שהוא קיים. המפלגה קיימת. האח הגדול הוא התגלמות המפלגה.\"\n\"האם הוא קיים באותו מובן שאני קיים?\"\n\"אתה לא קיים.\"\n \n1984, הרומן הדיסטופי הנודע ביותר בספרות העולם ועדיין המפתיע בחיותו ובאקטואליות שלו, ראה אור לראשונה ב־1949. ג\'ורג\' אורוול חוזה בו חזות דמיונית קשה על דמותו החברתית והפוליטית של העולם בעתיד, עולם השרוי במלחמה בין גושית מתמדת ואשר בו המפלגה שולטת שלטון עריצים אבסולוטי. \n \nבעולם זה, שנדרשת בו נאמנות אידאולוגית ללא סטייה קלה שבקלות, שהכול בו מפוקח בכל עת באמצעים אלקטרוניים ואחרים ואין בו מקום לאישיות ולפרט, מתנהל גיבור הספר וינסטון, אדם שעדיין מסוגל לחשיבה משלו. כשנוצר קשר אהבה בינו ובין אישה צעירה ששמה ג\'וליה, והשניים מנסים לממש את אהבתם האסורה ולמצוא להם זכות ויחוד משלהם, מעשיהם הופכים לביטוי של מרי שמעורר עליהם את זעמו הדורסני של המשטר.\n \nבמלאת שבעים שנה לפרסומו הראשון של 1984 אנו מגישים תרגום חדש של ספר חשוב זה.\n \nתרגום חדש: ארז וולק \n \nעיצוב העטיפה: יוסי למל מבכירי המעצבים הגרפיים בישראל העוסק בסוגיות חברתיות ופוליטיות.',5.00,30,'https://images-evrit.yit.co.il/Images/Products/covers_2019/1984_master.jpg'),(11,'פרנהייט 451','\"ספר הוא אקדח טעון בבית השכן. שרוף אותו.\nפרוק את הנשק. פרוץ למוחות של אנשים.\" \n \nגאי מונטאג היה כבאי שתפקידו להבעיר. הוא אהב את עבודתו. מעולם לא עצר כדי לתהות על העונג שהוא חש למראה הזוהר הכתום של האש בלילה, או על השמחה שמציפה אותו למראה להבות המאכלות דפי ספרים. כי בעולמו של מונטאג בעלוּת על ספר היא פשע שדינו שרֵפה של הספר ושל הבית שבו הוסתר, והכבאים הם אלו שמוטלת עליהם המלאכה, צנזורים עם גפרורים.\nזהו עולם של תקשורת המונים מטמטמת, של תוכניות מציאוּת אינטראקטיביות, עולם שיש בו פנאי אך אין בו חופש, שיש בו שפע אך אין בו אהבה.\nגאי מונטאג מעולם לא פיקפק בכך שהוא חי בעולם מושלם, עד שפגש נערה בת שבע־עשרה שסיפרה על עבר שבו אנשים חיו ללא פחד, ופרופסור בדימוס שסיפר על עתיד שבו אנשים יוכלו לחשוב. \n \nיצירת המופת של ריי ברדבורי ראתה אור ב־1953 ונותרה מרהיבה, מרתקת ומבעיתה גם בחלוף יותר ממחצית המאה. \"פרנהייט 451\" ניצב בשורה אחת עם הדיסטופיות הגדולות של המאה ה־20 — \"עולם חדש מופלא של אלדוס האקסלי\" ו־1984 של ג\'ורג\' אורוול — ומציע חזון עוכר שלווה ומעורר מחשבה, אך בד בבד מזמֵן לקורא נבואת נחמה שתיגע ללבו של כל אוהב ספר באשר הוא. \nעל אבן המצבה של ברדבורי, שהלך לעולמו ב־2012, נכתב רק: מחבר \"פרנהייט 451\", לכבוד מי שהאמין שכל המציל ספר אחד כאילו הציל עולם ומלואו. \nבתוספת אחרית דבר מאת המתרגמת נועה מנהיים.\n \nבעיצומו של השפל הכלכלי הגדול ביקר ריי ברדבורי בן ה־12 בקרקס. קוסם ושמו \"מר אלקטריקו\" נגע בקצה חוטמו של הצעיר בחרב מחושמלת שגרמה לכל שערותיו לסמור ואמר לו, \"חיֵה לנצח.\" זה היה הרגע שבו נגע בו ייעודו.\n\"הרגשתי שמשהו מוזר ונפלא קורה לי,\" סיפר ברדבורי, \"הוא העניק לי את העתיד. התחלתי לכתוב, וכתבתי כל יום מאז.\" אחרי התיכון עבד ברדבורי כמוכר עיתונים והרחיב את השכלתו בספרייה, ובה גם שכר מכונת כתיבה בעשרה סנט לחצי שעה והחל לכתוב את הסיפור הקצר \"כבאים\", שהפך, בעלות כוללת של כעשרה דולר, לרומן הראשון שלו, \"פרנהייט 451\".\nהספר זכה להצלחה בינלאומית, וב־1966 הפך לסרט בבימויו של פרנסואה טריפו.',10.00,30,'https://images-evrit.yit.co.il/Images/Products/KinneretMasters/prnhit451_master.jpg'),(12,'האדם מחפש משמעות ','ויקטור פרנקל (1977-1905), הוגה דעות, פרופסור לנוירולוגיה ולפסיכיאטריה, יהודי וינאי, אבי תורת הלוגותרפיה והגישה הפסיכותרפית למציאת משמעות לחיים, הלכה למעשה.\n\nסמוך לאחר שחרורו משלוש שנים במחנות ריכוז בגרמניה הנאצית, בן ארבעים, הוא כתב במשך תשעה ימים רצופים את האדם מחפש משמעות.\n\nבחיבורו המונומנטלי, שרואה עתה אור בתרגום מחודש ועדכני, מסיק פרנקל כי אפשר לקחת מהאדם הכול למעֵט חירות אחת: לבחור איך להגיב בכל נסיבות שהן; שמחובתו של אדם למצוא משמעות לחייו; שהאופן שבו הוא מקבל את גורלו ומתמודד עם סבלו מאפשר משמעות כזאת; שהאדם שהוא יהפוך להיות הִנו פרי החלטה פנימית ולא מציאוּת חיצונית.\n\nהספר נמכר ביותר מ־12 מיליון עותקים ונחשב לאחד מעשרת הספרים המשפיעים בעולם.\n\nפרנקל פירסם 40 ספרים שראו אור ביותר מ־50 שפות.',10.00,89,'https://images-evrit.yit.co.il/Images/Products/NewBO/Products/12141/mechapes_Master.jpg'),(14,'תנ״ך','הספר של העם היהודי',100.00,889,'https://islandpress.org/files/default_book_cover_2015.jpg');
/*!40000 ALTER TABLE `Products` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Users`
--

DROP TABLE IF EXISTS `Users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Users` (
  `Id` int NOT NULL AUTO_INCREMENT,
  `UserName` varchar(255) COLLATE utf8mb4_general_ci NOT NULL,
  `Password` varchar(255) COLLATE utf8mb4_general_ci NOT NULL,
  `Email` varchar(255) COLLATE utf8mb4_general_ci NOT NULL,
  `Phone` varchar(50) COLLATE utf8mb4_general_ci NOT NULL,
  `IsAdmin` tinyint(1) NOT NULL DEFAULT '0',
  PRIMARY KEY (`Id`)
) ENGINE=InnoDB AUTO_INCREMENT=20 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Users`
--

LOCK TABLES `Users` WRITE;
/*!40000 ALTER TABLE `Users` DISABLE KEYS */;
INSERT INTO `Users` VALUES (15,'admin','123456','sagiakshikar2003@gmail.com','0503009500',1),(17,'admin2','123456','sagiakshikar@gmail.com','0505009500',1),(18,'sagi1','123456','sagiak4shikar2003@gmail.com','0403009500',0);
/*!40000 ALTER TABLE `Users` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-05-06  0:26:26
